tap "aws/tap"
tap "domt4/autoupdate"
tap "flipperdevices/flipper"
tap "hashicorp/tap"
# Shell extension to jump to frequently used directories
brew "autojump"
# Official Amazon AWS command-line interface
brew "awscli"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# All-in-one assistant tool for Claude Code, Codex, Gemini, OpenCode and OpenClaw
brew "cc-switch-cli"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Isolated development environments using Docker
brew "docker-compose"
# Run arbitrary commands when files change
brew "entr"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Firebase command-line tools
brew "firebase-cli", link: false
# Terminal JSON viewer
brew "fx"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Library for USB device access
brew "libusb"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Kubernetes package manager
brew "helm"
# Client library for huggingface.co hub
brew "hf"
# Improved top (interactive process viewer)
brew "htop"
# Display an interface's bandwidth usage
brew "iftop"
# Implementation of the file(1) command
brew "libmagic"
# CLI utility that generates PDF from Markdown
brew "md2pdf", link: false
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node@24"
# Okta federated identity for AWS CLI
brew "okta-aws-cli"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Print the IP addresses in a given range
brew "prips"
# Simple, correct PEP 517 build frontend
brew "python-build"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Cross-shell prompt for astronauts
brew "starship"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Terminal multiplexer
brew "tmux"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Compact tool for building and debugging applications for Flipper Zero
brew "ufbt"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# ASGI web server
brew "uvicorn"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Command-line client for connecting to Snowflake
cask "snowflake-snowsql"
npm "@google/gemini-cli"
npm "aws-azure-login"
npm "firebase-tools"
npm "md-to-pdf"
npm "nodemon"
